print('===============================================')
print('Hello world!!!')
print('===============================================')
print('Это приложение для авто-решения разных математических задач.')
print('Что-бы начать пользоватся приложением есть такие команды:')
print('    1.math() - поможет вам посчитать дискриминант и вытекающие.')
print('    2.posl() - поможет посчитать арифметическую и геометрическую последовательности.')

## math()
def math():
    print('===============================================')
    a = int(input('Впишите перменную A '))
    b = int(input('Впишите перменную B '))
    c = int(input('Впишите перменную C '))
    D = (pow(b, 2)+4*a*c)
    x1 = (b + pow(D, 0.5))
    x2 = (b - pow(D, 0.5))  
    print('Дискриминант равняется -',D)
    print('x1 =',int(x1))
    print('x2 =',int(x2))
    print('===============================================')
    
## posl()
def posl():
    x = input()
    if x == 0:
        print('0')

math()